module.exports = {
    // 1. Вказуємо середовище, в якому буде використовуватися код. Наприклад, 'browser' для браузерного коду або 'node' для Node.js.
    env: {
      browser: true,
      es2021: true, // Підтримка сучасного синтаксису ECMAScript 2021
      node: true
    },
  
    // 2. Вказуємо стандартну конфігурацію Airbnb Base, яка забезпечує базові правила стилю коду.
    extends: [
      'airbnb-base',
    ],
  
    // 3. Вказуємо парсер і його налаштування. У даному випадку це стандартний парсер ESLint з підтримкою ECMAScript 12.
    parserOptions: {
      ecmaVersion: 12, // ECMAScript 2021
      sourceType: 'module', // Підтримка модульного синтаксису (import/export)
    },
  
    // 4. Вказуємо додаткові плагіни. 'import' допомагає контролювати імпорти, а 'promise' — правила роботи з промісами.
    plugins: [
      'import',
      'promise'
    ],
  
    // 5. Вказуємо додаткові правила, які можуть бути специфічними для вашого проекту.
    rules: {
      // Наприклад, ви можете захотіти змінити деякі правила Airbnb або додати свої власні:
      'no-console': 'off', // Вимикає правило, яке забороняє використання console.log()
      'indent': ['error', 2], // Встановлює два пробіли як стандартний відступ
      'linebreak-style': ['error', 'unix'], // Вимога для Unix-стилю переносу рядків (LF)
      'quotes': ['error', 'single'], // Вимога для використання одинарних лапок
      'semi': ['error', 'always'], // Вимога для використання крапки з комою
    },
  
    // 6. Налаштування import/resolver для коректної роботи імпорту модулів
    settings: {
      'import/resolver': {
        node: {
          extensions: ['.js', '.jsx', '.ts', '.tsx'] // Підтримка розширень файлів
        }
      }
    },
  };